#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.okta_app_group_lambda.local_file.placeholder_code: Refreshing state... [id=fb06c549e1e895bd4cd2bb65d4ec43f4e085d936]
module.okta_app_group_lambda.aws_iam_role_policy.lambda_okta_credentials: Refreshing state... [id=hagrid-okta-app-group-lambda-role:hagrid-okta-lambda-credentials]
module.okta_app_group_lambda.aws_iam_role_policy.lambda_ssm: Refreshing state... [id=hagrid-okta-app-group-lambda-role:hagrid-okta-lambda-ssm]
aws_ssm_parameter.app_context: Refreshing state... [id=/hagrid/app-context]
aws_ssm_parameter.okta_credentials: Refreshing state... [id=/hagrid/okta-credentials]
module.okta_app_group_lambda.aws_iam_role.lambda_role: Refreshing state... [id=hagrid-okta-app-group-lambda-role]
module.dynamodb_tables.aws_dynamodb_table.access_requests: Refreshing state... [id=hagrid-access-requests]
module.okta_app_group_lambda.aws_lambda_function.okta_app_group_updater: Refreshing state... [id=hagrid-okta-app-group-updater]
module.dynamodb_tables.aws_dynamodb_table.approval_messages: Refreshing state... [id=hagrid-approval-messages]
module.dynamodb_tables.aws_dynamodb_table.conversations: Refreshing state... [id=hagrid-conversations]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.okta_app_group_lambda.local_file.placeholder_code has been deleted
  - resource "local_file" "placeholder_code" {
      - content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually'}
        EOT -> null
        id                   = "fb06c549e1e895bd4cd2bb65d4ec43f4e085d936"
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # aws_api_gateway_deployment.prod will be created
  + resource "aws_api_gateway_deployment" "prod" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + triggers      = (known after apply)
    }

  # aws_api_gateway_integration.lambda_integration will be created
  + resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # aws_api_gateway_method.post_events will be created
  + resource "aws_api_gateway_method" "post_events" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # aws_api_gateway_resource.events will be created
  + resource "aws_api_gateway_resource" "events" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "events"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_resource.slack will be created
  + resource "aws_api_gateway_resource" "slack" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "slack"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.hagrid_api will be created
  + resource "aws_api_gateway_rest_api" "hagrid_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API Gateway for Hagrid Slack bot webhook events"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "hagrid-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags                         = {
          + "Name"    = "hagrid-api"
          + "Project" = "hagrid"
        }
      + tags_all                     = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-api"
          + "Project"   = "hagrid"
        }

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_api_gateway_stage.prod will be created
  + resource "aws_api_gateway_stage" "prod" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "prod"
      + tags          = {
          + "Name"    = "hagrid-api-prod"
          + "Project" = "hagrid"
        }
      + tags_all      = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-api-prod"
          + "Project"   = "hagrid"
        }
      + web_acl_arn   = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + caller         = "$context.identity.caller"
                  + httpMethod     = "$context.httpMethod"
                  + ip             = "$context.identity.sourceIp"
                  + protocol       = "$context.protocol"
                  + requestId      = "$context.requestId"
                  + requestTime    = "$context.requestTime"
                  + resourcePath   = "$context.resourcePath"
                  + responseLength = "$context.responseLength"
                  + status         = "$context.status"
                  + user           = "$context.identity.user"
                }
            )
        }
    }

  # aws_cloudwatch_log_group.api_gateway_logs will be created
  + resource "aws_cloudwatch_log_group" "api_gateway_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/apigateway/hagrid-api"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name"    = "hagrid-api-logs"
          + "Project" = "hagrid"
        }
      + tags_all          = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-api-logs"
          + "Project"   = "hagrid"
        }
    }

  # aws_iam_role.event_handler_lambda_role will be created
  + resource "aws_iam_role" "event_handler_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hagrid-event-handler-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"    = "hagrid-event-handler-role"
          + "Project" = "hagrid"
          + "Purpose" = "Execution role for Slack webhook event handler Lambda"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-event-handler-role"
          + "Project"   = "hagrid"
          + "Purpose"   = "Execution role for Slack webhook event handler Lambda"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.okta_lambda_role will be created
  + resource "aws_iam_role" "okta_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "hagrid-okta-app-group-updater-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"    = "hagrid-okta-lambda-role"
          + "Project" = "hagrid"
          + "Purpose" = "Execution role for Okta app group context updater Lambda"
        }
      + tags_all              = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-okta-lambda-role"
          + "Project"   = "hagrid"
          + "Purpose"   = "Execution role for Okta app group context updater Lambda"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.event_handler_cloudwatch will be created
  + resource "aws_iam_role_policy" "event_handler_cloudwatch" {
      + id          = (known after apply)
      + name        = "hagrid-event-handler-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-east-2:*:log-group:/aws/lambda/hagrid-event-handler:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.event_handler_dynamodb will be created
  + resource "aws_iam_role_policy" "event_handler_dynamodb" {
      + id          = (known after apply)
      + name        = "hagrid-event-handler-dynamodb"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:GetItem",
                          + "dynamodb:PutItem",
                          + "dynamodb:UpdateItem",
                          + "dynamodb:DeleteItem",
                          + "dynamodb:Query",
                          + "dynamodb:Scan",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-conversations",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-access-requests",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-approval-messages",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-conversations/index/*",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-access-requests/index/*",
                          + "arn:aws:dynamodb:us-east-2:949134893249:table/hagrid-approval-messages/index/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.event_handler_lambda_invoke will be created
  + resource "aws_iam_role_policy" "event_handler_lambda_invoke" {
      + id          = (known after apply)
      + name        = "hagrid-event-handler-lambda-invoke"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "lambda:InvokeFunction",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:us-east-2:*:function:hagrid-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.event_handler_ssm will be created
  + resource "aws_iam_role_policy" "event_handler_ssm" {
      + id          = (known after apply)
      + name        = "hagrid-event-handler-ssm"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:us-east-2:*:parameter/hagrid/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.okta_lambda_cloudwatch will be created
  + resource "aws_iam_role_policy" "okta_lambda_cloudwatch" {
      + id          = (known after apply)
      + name        = "hagrid-okta-lambda-cloudwatch"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:us-east-2:*:log-group:/aws/lambda/hagrid-okta-app-group-updater:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_iam_role_policy.okta_lambda_ssm will be created
  + resource "aws_iam_role_policy" "okta_lambda_ssm" {
      + id          = (known after apply)
      + name        = "hagrid-okta-lambda-ssm"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:PutParameter",
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:us-east-2:949134893249:parameter/hagrid/app-context"
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:us-east-2:949134893249:parameter/hagrid/okta-credentials"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_lambda_permission.api_gateway_invoke will be created
  + resource "aws_lambda_permission" "api_gateway_invoke" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "hagrid-event-handler"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.event_handler_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-event-handler.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.event_handler_lambda.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/placeholder/hagrid-event-handler.zip"
      + function_name                  = "hagrid-event-handler"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "hagrid-event-handler"
        }
      + tags_all                       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-event-handler"
          + "Project"   = "hagrid"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ACCESS_REQUESTS_TABLE"     = "hagrid-access-requests"
              + "APPROVAL_MESSAGES_TABLE"   = "hagrid-approval-messages"
              + "CONVERSATIONS_TABLE"       = "hagrid-conversations"
              + "LOG_LEVEL"                 = "INFO"
              + "OKTA_CREDENTIALS_SSM_NAME" = "/hagrid/okta-credentials"
              + "SSM_PARAMETER_NAME"        = "/hagrid/app-context"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.event_handler_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-event-handler/index.py"
      + id                   = (known after apply)
    }

  # module.okta_app_group_lambda.data.archive_file.placeholder will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "placeholder" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "modules/lambda/placeholder/hagrid-okta-app-group-updater.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + type                = "zip"

      + source {
          + content  = <<-EOT
                def lambda_handler(event, context):
                    return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
            EOT
          + filename = "index.py"
        }
    }

  # module.okta_app_group_lambda.aws_iam_role.lambda_role will be destroyed
  # (because aws_iam_role.lambda_role is not in configuration)
  - resource "aws_iam_role" "lambda_role" {
      - arn                   = "arn:aws:iam::949134893249:role/hagrid-okta-app-group-lambda-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-12-25T19:01:43Z" -> null
      - force_detach_policies = false -> null
      - id                    = "hagrid-okta-app-group-lambda-role" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "hagrid-okta-app-group-lambda-role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Name" = "hagrid-okta-app-group-lambda-role"
        } -> null
      - tags_all              = {
          - "ManagedBy" = "terraform"
          - "Name"      = "hagrid-okta-app-group-lambda-role"
          - "Project"   = "hagrid"
        } -> null
      - unique_id             = "AROA5Z7GZEDARTX7LJZLM" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "hagrid-okta-lambda-credentials" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ssm:GetParameter",
                              - "ssm:GetParameters",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:ssm:us-east-2:949134893249:parameter/hagrid/okta-credentials"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "hagrid-okta-lambda-ssm" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "ssm:PutParameter",
                              - "ssm:GetParameter",
                              - "ssm:GetParameters",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:ssm:us-east-2:949134893249:parameter/hagrid/app-context"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.okta_app_group_lambda.aws_iam_role_policy.lambda_okta_credentials will be destroyed
  # (because aws_iam_role_policy.lambda_okta_credentials is not in configuration)
  - resource "aws_iam_role_policy" "lambda_okta_credentials" {
      - id          = "hagrid-okta-app-group-lambda-role:hagrid-okta-lambda-credentials" -> null
      - name        = "hagrid-okta-lambda-credentials" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "ssm:GetParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:us-east-2:949134893249:parameter/hagrid/okta-credentials"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "hagrid-okta-app-group-lambda-role" -> null
        # (1 unchanged attribute hidden)
    }

  # module.okta_app_group_lambda.aws_iam_role_policy.lambda_ssm will be destroyed
  # (because aws_iam_role_policy.lambda_ssm is not in configuration)
  - resource "aws_iam_role_policy" "lambda_ssm" {
      - id          = "hagrid-okta-app-group-lambda-role:hagrid-okta-lambda-ssm" -> null
      - name        = "hagrid-okta-lambda-ssm" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:PutParameter",
                          - "ssm:GetParameter",
                          - "ssm:GetParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:us-east-2:949134893249:parameter/hagrid/app-context"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "hagrid-okta-app-group-lambda-role" -> null
        # (1 unchanged attribute hidden)
    }

  # module.okta_app_group_lambda.aws_lambda_function.function will be created
  + resource "aws_lambda_function" "function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "modules/lambda/placeholder/hagrid-okta-app-group-updater.zip"
      + function_name                  = "hagrid-okta-app-group-updater"
      + handler                        = "index.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "hagrid-okta-app-group-updater"
        }
      + tags_all                       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "hagrid-okta-app-group-updater"
          + "Project"   = "hagrid"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "LOG_LEVEL"                 = "INFO"
              + "OKTA_CREDENTIALS_SSM_NAME" = "/hagrid/okta-credentials"
              + "SSM_PARAMETER_NAME"        = "/hagrid/app-context"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.okta_app_group_lambda.aws_lambda_function.okta_app_group_updater will be destroyed
  # (because aws_lambda_function.okta_app_group_updater is not in configuration)
  - resource "aws_lambda_function" "okta_app_group_updater" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-east-2:949134893249:function:hagrid-okta-app-group-updater" -> null
      - code_sha256                    = "mQaNFcxV0SnxBHxnEQEZtHWi4cqSLlzexeiSM8OOPBk=" -> null
      - filename                       = "modules/okta_app_group_lambda/placeholder.zip" -> null
      - function_name                  = "hagrid-okta-app-group-updater" -> null
      - handler                        = "index.lambda_handler" -> null
      - id                             = "hagrid-okta-app-group-updater" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:949134893249:function:hagrid-okta-app-group-updater/invocations" -> null
      - last_modified                  = "2026-01-07T19:05:52.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:us-east-2:949134893249:layer:okta-layer-python:1",
        ] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-east-2:949134893249:function:hagrid-okta-app-group-updater:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:949134893249:function:hagrid-okta-app-group-updater:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::949134893249:role/hagrid-okta-app-group-lambda-role" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "KPuCyhn23iUmFTBu5sHOTH4p15RK8MX+Q+vaNXQO1Mg=" -> null
      - source_code_size               = 3154 -> null
      - tags                           = {
          - "Name" = "hagrid-okta-app-group-updater"
        } -> null
      - tags_all                       = {
          - "ManagedBy" = "terraform"
          - "Name"      = "hagrid-okta-app-group-updater"
          - "Project"   = "hagrid"
        } -> null
      - timeout                        = 300 -> null
      - version                        = "$LATEST" -> null
        # (6 unchanged attributes hidden)

      - environment {
          - variables = {
              - "LOG_LEVEL"                 = "INFO"
              - "OKTA_CREDENTIALS_SSM_NAME" = "/hagrid/okta-credentials"
              - "SSM_PARAMETER_NAME"        = "/hagrid/app-context"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/hagrid-okta-app-group-updater" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.okta_app_group_lambda.local_file.placeholder_code will be created
  + resource "local_file" "placeholder_code" {
      + content              = <<-EOT
            def lambda_handler(event, context):
                return {'statusCode': 200, 'body': 'Placeholder - update code manually or via CI/CD'}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "modules/lambda/placeholder/hagrid-okta-app-group-updater/index.py"
      + id                   = (known after apply)
    }

Plan: 21 to add, 0 to change, 4 to destroy.

Changes to Outputs:
  + api_gateway_id                  = (known after apply)
  + api_gateway_url                 = (known after apply)
  + event_handler_function_arn      = (known after apply)
  + event_handler_function_name     = "hagrid-event-handler"
  ~ lambda_function_arn             = "arn:aws:lambda:us-east-2:949134893249:function:hagrid-okta-app-group-updater" -> (known after apply)
  ~ lambda_role_arn                 = "arn:aws:iam::949134893249:role/hagrid-okta-app-group-lambda-role" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @m0liere, Action: `pull_request`*